Catalogs/Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Адреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Адреса/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Проверяет заполненность обязательных полей и формирует наименование перед записью объекта
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    // Проверка заполнения поля Улица
    Если Не ЗначениеЗаполнено(Объект.Улица) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Улица обязательно для заполнения!";
        Сообщение.Поле = "Улица";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Проверка заполнения поля Дом
    Если Не ЗначениеЗаполнено(Объект.Дом) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Дом обязательно для заполнения!";
        Сообщение.Поле = "Дом";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Проверка заполнения поля Страна
    Если Не ЗначениеЗаполнено(Объект.Страна) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Страна обязательно для заполнения!";
        Сообщение.Поле = "Страна";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Проверка заполнения поля Регион
    Если Не ЗначениеЗаполнено(Объект.Регион) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Регион обязательно для заполнения!";
        Сообщение.Поле = "Регион";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Проверка заполнения поля Город
    Если Не ЗначениеЗаполнено(Объект.Город) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле Город обязательно для заполнения!";
        Сообщение.Поле = "Город";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    // Формирование наименования из полей Улица и Дом с суффиксом "ул"
    Объект.Наименование = СокрЛП(Объект.Улица) + " ул" + ?(ЗначениеЗаполнено(Объект.Дом), ", дом № " + СокрЛП(Объект.Дом), "");
    
    // Ограничение длины наименования до 150 символов
    Объект.Наименование = Лев(Объект.Наименование, 150);
КонецПроцедуры

// Модуль формы справочника ЛокальныеУведомления (ФормаЭлемента)
// Настраивает форму при создании на сервере
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если используется мобильный клиент, делаем поля только для чтения
	Если ПараметрыСеанса.ЭтоМобильныйКлиент Тогда 
        Элементы.Код.ТолькоПросмотр = Истина;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Страна.ТолькоПросмотр = Истина;
		Элементы.Регион.ТолькоПросмотр = Истина;
		Элементы.Город.ТолькоПросмотр = Истина;
		Элементы.Улица.ТолькоПросмотр = Истина;
		Элементы.Дом.ТолькоПросмотр = Истина;
		Элементы.Индекс.ТолькоПросмотр = Истина;
	Иначе 
		// Уведомление для не-мобильного клиента
		Сообщить("Это сервер");
	КонецЕсли;
		
КонецПроцедуры
